Results/3Singularity/resultsMEM.txt
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32MiB each
4GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      400.27
    writes/s:                     266.85
    fsyncs/s:                     854.47

Throughput:
    read, MiB/s:                  6.25
    written, MiB/s:               4.17

General statistics:
    total time:                          120.0632s
    total number of events:              182567

Latency (ms):
         min:                                    0.00
         avg:                                    0.66
         max:                                   19.10
         95th percentile:                        3.68
         sum:                               119702.64

Threads fairness:
    events (avg/stddev):           182567.0000/0.00
    execution time (avg/stddev):   119.7026/0.00